/**
 * JavaScript面向对象（类似哈希表 + 优化结构）
 * 
 * 传统对象 vs JavaScript对象
 * 
 * 传统的面向对象
 * 面向对象语言的一个标志就是类
 * 类是所有对象的统称, 是更高意义上的一种抽象. 对象是类的实例
 * 通过类我们可以创建任意多个具体的对象
 * 在学习 C++/Java/Python 等编程语言的时候, 都可以按照这种方式去创建类和对象
 * 
 * JavaScript 的面向对象
 * JavaScript 中没有类的概念（ES6 之前），因此我们通常称为基于对象，而不是面向对象
 * 虽然 JavaScript 中的基于对象也可以实现类似于类的封装、继承、甚至是多态。但是和传统意义的面向对象还是稍微有一些差异
 * ECMA 中定义对象是这样: 无序属性的集合, 属性可以包含基本值, 对象或者函数
 * 也就是对象是一组没有顺序的值组成的集合而已
 * 对象的每个属性或者方法都有一个名字, 而名字对应一个值. 有没有觉得非常熟悉
 * 没错, 其实就是我们经常看到和使用的映射(或者有些语言称为字典, 通常会使用哈希表来实现)
 */

